{
  "architectures": [
    "FGCLIPModel"
  ],
  "initializer_factor": 1.0,
  "logit_scale_init_value": 4.6052,
  "model_type": "clip",
  "projection_dim": 512,
  "text_config": {
    "dropout": 0.0,
    "model_type": "clip_text_model",
    "pad_token_id": 49407
  },
  "torch_dtype": "bfloat16",
  "transformers_version": "4.47.1",
  "vision_config": {
    "dropout": 0.0,
    "model_type": "clip_vision_model"
  }
}
